print("---------Задание номер1----------")
print('Hello World')
print('МАША+АЛЬБЕРТ=ЛЮБОВЬ')
print('x=3+4')
print('x=результат решения предыдущего примера')
print("   ")
print("---------Задание номер2----------")
x='Hewo world'
print(type(x))
x=3+4
print(type(x))
x=3/4
print(type(x))
x=[1,2,5,10,100]
print(type(x))
print("      ")
print("---------Задание номер3----------")
x=3
y=((x**0.5**2)/(x**3+3/x))*(4*x**7-x**5)+80*((27*x**4+12*x**3-5*x**2+10)**0.5)
print(y)
y=(3%2+(16.7*4.32)//1)/(14.5+31%12-(x**3.4//1))
print(y)
print('    ')
print("---------Задание номер4----------")
a=[1,5,'Good','Bad']
b=[9,'Blue','Red',11]
print(a[1]+b[3])
print(a[2]+b[2])
print(a[0]*b[2])
print(a[1]**b[3])
print(a+b)